Show / Hide Table of Contents
Class GrpcServer
Server implementation for the Grpc connection.
Inheritance
System.Object
GrpcService.GrpcServiceBase
GrpcServer
GrpcReflectionServer
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcServer : GrpcService.GrpcServiceBase
Constructors
Improve this Doc   View Source
GrpcServer(Int32)
Initializes the IdeaStatiCa Grpc server.
Declaration
public GrpcServer(int port)
Parameters
 Type |  Name |  Description
 System.Int32 |  port
Sets the Port
Properties
Improve this Doc   View Source
ClientID
Returns ID of currently connected client.
Declaration
public string ClientID { get; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
IsConnected
Determines whether the client is connected.
Declaration
public bool IsConnected { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Port
Port on which the server will communicate.
Declaration
protected int Port { get; }
Property Value
 Type |  Description
 System.Int32
Methods
Improve this Doc   View Source
ConnectAsync(IAsyncStreamReader<GrpcMessage>, IServerStreamWriter<GrpcMessage>, ServerCallContext)
Establishes a two way connection between server and client.
Declaration
public override Task ConnectAsync(IAsyncStreamReader<GrpcMessage> requestStream, IServerStreamWriter<GrpcMessage> responseStream, ServerCallContext context)
Parameters
 Type |  Name |  Description
 Grpc.Core.IAsyncStreamReader<GrpcMessage> |  requestStream
Data incoming from client
 Grpc.Core.IServerStreamWriter<GrpcMessage> |  responseStream
Data sent to client
 Grpc.Core.ServerCallContext |  context
Returns
 Type |  Description
 System.Threading.Tasks.Task
Overrides
GrpcService.GrpcServiceBase.ConnectAsync(IAsyncStreamReader<GrpcMessage>, IServerStreamWriter<GrpcMessage>, ServerCallContext)
Improve this Doc   View Source
HandleMessageAsync(GrpcMessage)
Handle incoming messages.
Declaration
protected virtual Task HandleMessageAsync(GrpcMessage message)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
Message incoming from client.
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
RegisterHandler(String, IGrpcMessageHandler)
Registers a message handler.
Declaration
public void RegisterHandler(string handlerId, IGrpcMessageHandler handler)
Parameters
 Type |  Name |  Description
 System.String |  handlerId
UniqueID of the handler.
 IGrpcMessageHandler |  handler
Handler implementation.
Improve this Doc   View Source
SendMessageAsync(String, String, String)
Sends a message to client.
Declaration
public Task SendMessageAsync(string operationId, string messageName, string data = "")
Parameters
 Type |  Name |  Description
 System.String |  operationId
 System.String |  messageName
Message identificator.
 System.String |  data
Body of the message.
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
Start()
Initializes server on specified port.
Declaration
public void Start()
Events
Improve this Doc   View Source
ClientConnected
Triggered every time client connects. Sends a client ID in args.
Declaration
public event EventHandler<string> ClientConnected
Event Type
 Type |  Description
 System.EventHandler<System.String>
Improve this Doc   View Source
ClientDisconnected
Triggered when client has disconnected. Sends a client ID in args.
Declaration
public event EventHandler<string> ClientDisconnected
Event Type
 Type |  Description
 System.EventHandler<System.String>
Improve this Doc   View Source
MessageReceived
Triggered every time a message is received from client.
Declaration
public event EventHandler<GrpcMessage> MessageReceived
Event Type
 Type |  Description
 System.EventHandler<GrpcMessage>
 Improve this Doc
 View Source